In [1]:
import pandas as pd

In [44]:
data = pd.read_csv('data/covid_data.csv')
col = pd.read_csv('data/cardio_base.csv')
card = pd.read_csv('data/cardio_alco.csv', sep=';')

In [45]:
col.groupby('gender').agg({'smoke': 'count'})

        smoke
gender
1       45530
2       24470

In [46]:
45530/24470

1.8606456885982836

In [47]:
card.head(3)

   id  alco
0  44     0
1  45     0
2  46     0

In [20]:
col['q'] = pd.qcut(col['height'], 10)

In [21]:
col

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,smoke,q
0,0,18393,2,168,62.0,110,80,1,0,"(166.0, 168.0]"
1,1,20228,1,156,85.0,140,90,3,0,"(155.0, 158.0]"
2,2,18857,1,165,64.0,130,70,3,0,"(162.0, 165.0]"
3,3,17623,2,169,82.0,150,100,1,0,"(168.0, 170.0]"
4,4,17474,1,156,56.0,100,60,1,0,"(155.0, 158.0]"
...,...,...,...,...,...,...,...,...,...,...
69995,99993,19240,2,168,76.0,120,80,1,1,"(166.0, 168.0]"
69996,99995,22601,1,158,126.0,140,90,2,0,"(155.0, 158.0]"
69997,99996,19066,2,183,105.0,180,90,3,0,"(175.0, 250.0]"
69998,99998,22431,1,163,72.0,135,80,1,0,"(162.0, 165.0]"
69999,99999,20540,1,170,72.0,120,80,2,0,"(168.0, 170.0]"

In [22]:
col.groupby('q').agg({'height': 'mean'})

                     height
q
(54.999, 155.0]  151.261478
(155.0, 158.0]   157.070794
(158.0, 160.0]   159.715792
(160.0, 162.0]   161.655464
(162.0, 165.0]   164.283638
(165.0, 166.0]   166.000000
(166.0, 168.0]   167.634136
(168.0, 170.0]   169.626372
(170.0, 175.0]   173.068846
(175.0, 250.0]   179.566499

In [36]:
col['height'].describe()

count    70000.000000
mean       164.359229
std          8.210126
min         55.000000
25%        159.000000
50%        165.000000
75%        170.000000
max        250.000000
Name: height, dtype: float64

In [38]:
var = col['height'].var()

In [39]:
import math

In [41]:
math.sqrt(var)*2

16.420252729076076

In [48]:
data_2 = col.merge(card, on='id', how='inner')

In [57]:
ig = ['Germany']

In [64]:
gd = data.query('location in @ig')[['date', 'new_cases']].rename(columns={'new_cases': 'g_cases'})

In [80]:
id = data.query('location == "Italy"')[['date', 'new_cases']].rename(columns={'new_cases': 'i_cases'})

In [82]:
d = id.merge(gd, on = 'date')

In [86]:
d['diff'] = d['i_cases']-d['g_cases']

In [92]:
d['diff'] = d['diff'].rolling(2).sum()

In [97]:
data.head()

,location,date,new_cases,new_deaths,population,aged_65_older_percent,gdp_per_capita,hospital_beds_per_thousand
0,Afghanistan,2019-12-31,0,0,38928341.0,2.581,1803.987,0.5
1,Afghanistan,2020-01-01,0,0,38928341.0,2.581,1803.987,0.5
2,Afghanistan,2020-01-02,0,0,38928341.0,2.581,1803.987,0.5
3,Afghanistan,2020-01-03,0,0,38928341.0,2.581,1803.987,0.5
4,Afghanistan,2020-01-04,0,0,38928341.0,2.581,1803.987,0.5

In [110]:
death =data.groupby('location').agg({'new_deaths': 'sum'}).sort_values(by='new_deaths')

In [111]:
death['rate'] = death['new']

                                 new_deaths
location
Bonaire Sint Eustatius and Saba           0
Timor                                     0
French Polynesia                          0
Namibia                                   0
Fiji                                      0
...                                     ...
Italy                                 34043
Brazil                                38406
United Kingdom                        40883
United States                        112006
World                                411195

[212 rows x 1 columns]